In [1168]:
import pandas as pd

In [1169]:
td=pd.read_csv('Titanic-Dataset.csv')

In [1170]:
td.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [1171]:
td.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [1172]:
td.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [1173]:
td['Age'].mean()
td['Age'].fillna(30,inplace=True)

C:\Users\nihal\AppData\Local\Temp\ipykernel_6128\1060318930.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  td['Age'].fillna(30,inplace=True)

In [1174]:
td['Cabin'].ffill(inplace=True)

C:\Users\nihal\AppData\Local\Temp\ipykernel_6128\1299890483.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  td['Cabin'].ffill(inplace=True)

In [1175]:
td['Embarked'].backfill(inplace=True)

C:\Users\nihal\AppData\Local\Temp\ipykernel_6128\3860622466.py:1: FutureWarning: DataFrame.backfill/Series.backfill is deprecated. Use DataFrame.bfill/Series.bfill instead
  td['Embarked'].backfill(inplace=True)

In [1176]:
td.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        890 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [1177]:
td['Age']=td['Age'].astype(int)

In [1178]:
td['Fare']=td['Fare'].astype(int)

In [1179]:
from sklearn.preprocessing import LabelEncoder
l=LabelEncoder()

In [1180]:
td['Name']=l.fit_transform(td['Name'])

In [1181]:
td['Sex']=l.fit_transform(td['Sex'])

In [1182]:
td['Ticket']=l.fit_transform(td['Ticket'])

In [1183]:
td['Cabin']=l.fit_transform(td['Cabin'])

In [1184]:
td['Embarked']=l.fit_transform(td['Embarked'])

In [1185]:
td.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,108,1,22,1,0,523,7,147,2
1,2,1,1,190,0,38,1,0,596,71,81,0
2,3,1,3,353,0,26,0,0,669,7,81,2
3,4,1,1,272,0,35,1,0,49,53,55,2
4,5,0,3,15,1,35,0,0,472,8,55,2

In [1186]:
x=td.drop(['PassengerId','Survived','Name','Ticket','Fare'],axis=1)

In [1187]:
y=td['Survived']

In [1188]:
from sklearn.model_selection import train_test_split
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=0.2)

In [1189]:
print(xtrain)

     Pclass  Sex  Age  SibSp  Parch  Cabin  Embarked
463       2    1   48      0      0    133         2
38        3    0   18      2      0     41         2
351       1    1   30      0      0     59         2
715       3    1   19      0      0    140         2
796       1    0   49      0      0     94         2
..      ...  ...  ...    ...    ...    ...       ...
47        3    0   30      0      0     41         1
524       3    1   30      0      0     17         0
578       3    0   30      1      0    128         0
651       2    0   18      0      1      7         2
887       1    0   19      0      0     30         2

[712 rows x 7 columns]

In [1190]:
print(xtest)

     Pclass  Sex  Age  SibSp  Parch  Cabin  Embarked
811       3    1   39      0      0    137         2
116       3    1   70      0      0     52         1
829       1    0   62      0      0     21         0
835       1    0   39      1      1    130         0
377       1    1   27      0      2     79         0
..      ...  ...  ...    ...    ...    ...       ...
629       3    1   30      0      0    114         1
10        3    0    4      1      1    145         2
750       2    0    4      1      1    100         2
671       1    1   31      1      0     38         2
643       3    1   30      0      0     24         2

[179 rows x 7 columns]

In [1191]:
print(ytrain)

463    0
38     0
351    0
715    0
796    1
      ..
47     1
524    0
578    0
651    1
887    1
Name: Survived, Length: 712, dtype: int64

In [1192]:
print(ytest)

811    0
116    0
829    1
835    1
377    0
      ..
629    0
10     1
750    1
671    0
643    1
Name: Survived, Length: 179, dtype: int64

In [1193]:
from sklearn.linear_model import LogisticRegression
model=LogisticRegression()

In [1194]:
model.fit(xtrain,ytrain)
model.predict(xtest)

c:\Users\nihal\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\linear_model\_logistic.py:465: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. OF ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

array([0, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1,
       1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0,
       1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0,
       0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0,
       0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 0])

In [1195]:
model.score(xtest,ytest)

0.8435754189944135